<!DOCTYPE html>
<html dir="ltr">
<head>
    <title>Configuraci&#243;n de comunicaci&#243;n con dispositivos - Documentaci&#243;n de Rapid SCADA</title>
    <meta charset="utf-8">
    <link href="../../../../css/scadadoc.min.css" rel="stylesheet" type="text/css">
    <script type="text/javascript" src="../../../../lib/jquery/jquery.min.js"></script>
    <script type="text/javascript" src="../js/contents.js"></script>
    <script type="text/javascript" src="../../../../js/scadadoc.js"></script>
</head>
<body>
    <h1>Configuraci&#243;n de comunicaci&#243;n con dispositivos</h1>

    <p>La interacci&#243;n con los dispositivos reales o virtuales se realiza mediante la aplicaci&#243;n Comunicator que funciona como un m&#225;ster o un esclavo, solicitando los datos y enviando comandos a los dispositivos. Todos los dispositivos est&#225;n vinculados a las l&#237;neas de comunicaci&#243;n. Las l&#237;neas de comunicaci&#243;n son&#160;independientes&#160;entre&#160;s&#237; y funcionan en paralelo.</p>

    <p>La interfaz de usuario del Comunicator, siendo dise&#241;ada para la configuraci&#243;n, est&#225; integrada en la aplicaci&#243;n llamada Administrator. El Comunicator est&#225; configurado como parte de un proyecto.</p>

    <p>La imagen 1 muestra un ejemplo de los par&#225;metros de la l&#237;nea de comunicaci&#243;n principal. Un canal de comunicaci&#243;n define la interfaz f&#237;sica o un protocolo de red que se usa para intercambiar los datos con los dispositivos. Se soportan los siguientes canales de comunicaci&#243;n: Puerto serie, cliente TCP, servidor, TCP y UDP. A veces si la interacci&#243;n con un dispositivo se realiza por el controlador del mismo, el canal de comunicaci&#243;n sea &quot;indefinido&quot; (p.ej., el controlador (driver) OPC).</p>

    <p>Si no se requiere enviar comandos a los dispositivos, se recomienda desmarcar la casilla de verificaci&#243;n <em>Commands enabled (Comandos habilitados)</em> por razones de&#160;seguridad.</p>

    <p class="sd-article-image"> <img src="communication-with-devices-files/comm_line_params_en.png" alt="Parámetros principales de una línea de comunicación"><br> Imagen 1. Par&#225;metros principales de una l&#237;nea de comunicaci&#243;n </p>

    <p class="sd-article-image"> <img src="communication-with-devices-files/comm_line_req_en.png" alt="Secuencia de solicitud"><br> Imagen 2. Secuencia de solicitud </p>

    <p>El orden en que se realiza la comunicaci&#243;n y los par&#225;metros de la solicitud est&#225;n establecidos en la p&#225;gina <em>Request Sequence (Secuencia de solicitud),</em> (refi&#233;rase a la Imagen 2).</p>

    <p>Si la casilla de verificaci&#243;n <em>Active </em>en la p&#225;gina <em>Main Parameters (Par&#225;metros principales)</em> est&#225; desmarcada, la l&#237;nea de comunicaci&#243;n correspondiente est&#225; deshabilitada y no se realizan solicitudes en esa l&#237;nea. Si la casilla de verificaci&#243;n <em>Active </em>en el cuadro <em>Request Sequence - Selected Device (Dispositivo seleccionado)</em> est&#225; desmarcada, la comunicaci&#243;n con el dispositivo seleccionado est&#225; deshabilitada.</p>

    <p>La casilla de verificaci&#243;n <em>Bound to Server (Vinculado con el servidor)</em> en la p&#225;gina <em>Main Parameters</em> permite activar o desactivar el env&#237;o de los datos de la l&#237;nea de comunicaci&#243;n al Servidor. La casilla de verificaci&#243;n <em>Bound to Server</em> en el cuadro de grupo <em>Selected Device</em> tiene el mismo objetivo, aunque se aplica solamente para el dispositivo. Si la casilla de verificaci&#243;n<em> Interact with Server (Interacci&#243;n con servidor) </em>en la p&#225;gina <em>Custom Parameters (Par&#225;metros comunes) </em>de los ajustes del Comunicador est&#225; desmarcada, toda interacci&#243;n entre el Comunicator y el Server est&#225; deshabilitada. Estas opciones son &#250;tiles para probar nuevos dispositivos que est&#225;n conectados al sistema.</p>

    <p>Si los par&#225;metros <em>Time (Hora) </em>y <em>Period (Per&#237;odo) </em> de un dispositivo son a cero, el dispositivo se solicita de manera c&#237;clica. Si el par&#225;metro <em>Time </em>es mayor que cero y el <em>Period </em>es cero, el dispositivo se solicita una vez al d&#237;a en la hora especificada. Si el <em>Period </em>es mayor que cero, el dispositivo se solicita peri&#243;dicamente a partir de la hora especificada. El campo <em>Timeout (Tiempo de espera)</em> define cuanto esperar por una respuesta del dispositivo tras una solicitud. El campo <em>Delay (Retraso) </em>define un tiempo tras que cada solicitud enviada al dispositivo. <em>Command line (L&#237;nea de comando) </em>puede contener par&#225;metros adicionales descritos en la documentaci&#243;n de un controlador del dispositivo.</p>

    <p>Para restablecer los par&#225;metros de solicitud del dispositivo seleccionado a los valores por defecto, haga clic en el bot&#243;n <em>Reset (Restablecer)</em>. Para abrir el formulario de propiedades del dispositivo, en caso de que sea soportado por el controlador del dispositivo seleccionado, haga clic en el bot&#243;n <em>Properties (Propiedades) </em>o use el men&#250; emergente del explorador de proyectos. Para establecer las propiedades globales para un tipo de dispositivo, elija la p&#225;gina <em>Drivers (Controladores)</em>, seleccione el controlador del dispositivo y haga clic en el bot&#243;n <em>Properties </em>si est&#225; habilitado.</p>

    <p>Para importar las l&#237;neas de comunicaci&#243;n y los dispositivos de la base de datos de configuraci&#243;n a la configuraci&#243;n del Comunicator, haga clic derecho en el nodo <em>Communication Lines</em> o en un nodo de una l&#237;nea de comunicaci&#243;n espec&#237;fica en el explorador de proyectos y seleccione el &#237;tem Import (Importar) en el men&#250; contextual.<em></em> El formulario de importaci&#243;n se muestra en la Imagen 3.</p>

    <p class="sd-article-image"> <img src="communication-with-devices-files/comm_import_en.png" alt="Ajustes de importación del Comunicador"><br> Imagen 3. Ajustes de importaci&#243;n del Comunicador </p>

    <p>La funci&#243;n de ajustes de la sincronizaci&#243;n del Communicator Sync Communicator Settings (Ajustes de sincronizaci&#243;n del Comunicador) (refi&#233;rase a la Imagen 4), se realiza usando el men&#250; contextual de la l&#237;nea de comunicaci&#243;n. La sincronizaci&#243;n permite actualizar los par&#225;metros de las l&#237;neas de comunicaci&#243;n y de los dispositivos existentes seg&#250;n la base de datos de configuraci&#243;n. Sin embargo, los par&#225;metros ingresados a mano podr&#237;an perderse.</p>

    <p class="sd-article-image"> <img src="communication-with-devices-files/comm_sync_en.png" alt="Ajustes de sincronización del Comunicador"><br> Imagen 4. Ajustes de sincronizaci&#243;n del Comunicador </p>
</body>
</html>
