<!DOCTYPE html>
<html dir="ltr">
<head>
    <title>Configuraci&#243;n de comunicaci&#243;n con dispositivos - Documentaci&#243;n de Rapid SCADA</title>
    <meta charset="utf-8">
    <link href="../../../../css/scadadoc.min.css" rel="stylesheet" type="text/css">
    <script type="text/javascript" src="../../../../lib/jquery/jquery.min.js"></script>
    <script type="text/javascript" src="../js/contents.js"></script>
    <script type="text/javascript" src="../../../../js/scadadoc.js"></script>
</head>
<body>
    <h1>Configuraci&#243;n de comunicaci&#243;n con dispositivos</h1>

    <p>La interacci&#243;n con los dispositivos reales o virtuales se realiza por la aplicaci&#243;n llamada Comunicador que funciona como un m&#225;ster o un esclavo, solicita los datos y env&#237;a comandos a los dispositivos. Todos los dispositivos est&#225;n vinculados con las l&#237;neas de comunicaci&#243;n. Las l&#237;neas de comunicaci&#243;n son&#160;independientes&#160;entre&#160;s&#237; y funcionan en paralelo.</p>

    <p>La interfaz de usuario del Comunicador, siendo dise&#241;ada para la configuraci&#243;n, est&#225; integrada en la aplicaci&#243;n llamada Administrador. El Comunicador est&#225; configurado como parte de un proyecto.</p>

    <p>Imagen 1 muestra un ejemplo de par&#225;metros de la l&#237;nea de comunicaci&#243;n principal. Un canal de comunicaci&#243;n define la interfaz f&#237;sica o un protocolo de red que se usa para intercambiar los datos con los dispositivos. Se apoyan los siguientes canales de comunicaci&#243;n: Serial port, TCP client, TCP server y UDP. A veces si la interacci&#243;n con los dispositivos se realiza por un controlador del dispositivo, se requiere que el canal de comunicaci&#243;n est&#233; indefinido (p.ej., el controlador OPC).</p>

    <p>Si no se requiere enviar comandos a los dispositivos, se recomienda desmarcar la casilla de verificaci&#243;n <em>Comandos habilitados</em> por razones de&#160;seguridad.</p>

    <p class="sd-article-image"> <img src="communication-with-devices-files/comm_line_params_en.png" alt="Parámetros principales de la línea de comunicación"><br> Imagen 1. Par&#225;metros principales de la l&#237;nea de comunicaci&#243;n </p>

    <p class="sd-article-image"> <img src="communication-with-devices-files/comm_line_req_en.png" alt="Secuencia de solicitud"><br> Imagen 2. Secuencia de solicitud </p>

    <p>El orden de comunicaci&#243;n y los par&#225;metros de solicitud est&#225;n establecidos en la p&#225;gina <em>Secuencia de solicitud</em> (refi&#233;rase a la Imagen 2).</p>

    <p>Si la casilla de verificaci&#243;n <em>Activo </em>en la p&#225;gina <em>Par&#225;metros principales</em> est&#225; desmarcada, la l&#237;nea de comunicaci&#243;n correspondiente est&#225; deshabilitada y las solicitudes no se realizan. Si la casilla de verificaci&#243;n <em>Activo </em>en el cuadro de grupo <em>Dispositivo seleccionado</em> est&#225; desmarcada, la comunicaci&#243;n con aquel dispositivo est&#225; deshabilitada.</p>

    <p>La casilla de verificaci&#243;n <em>Vinculado con servidor</em> en la p&#225;gina <em>Par&#225;metros principales</em> permite activar o desactivar el env&#237;o de los datos de la l&#237;nea de comunicaci&#243;n al Servidor. La casilla de verificaci&#243;n <em>Vinculado con servidor</em> en el cuadro de grupo <em>Dispositivo seleccionado</em> tiene el mismo objetivo, aunque se aplica solamente para el dispositivo. Si la casilla de verificaci&#243;n<em> Interacci&#243;n con servidor </em>en la p&#225;gina <em>Par&#225;metros comunes </em>de los ajustes del Comunicador est&#225; desmarcada, cualquier interacci&#243;n entre el Comunicador y el Servidor est&#225; deshabilitada. Estas opciones son &#250;tiles para probar nuevos dispositivos que est&#225;n conectados con el sistema.</p>

    <p>Si los par&#225;metros de un dispositivo <em>Hora </em>y <em>Per&#237;odo </em>son iguales a cero, el dispositivo se solicita de manera c&#237;clica. Si el par&#225;metro <em>Hora </em>es m&#225;s de cero y el <em>Per&#237;odo </em>es cero, el dispositivo se solicita una vez al d&#237;a en la hora especificada. Si el <em>Per&#237;odo </em>es m&#225;s de cero, el dispositivo se solicita peri&#243;dicamente a partir de la hora especificada. El campo <em>Tiempo de espera</em> define el tiempo de espera de respuesta del dispositivo despu&#233;s de la solicitud. El campo <em>Retraso </em>define un retraso despu&#233;s de cada solicitud enviada al dispositivo. La <em>L&#237;nea de comando </em>puede contener par&#225;metros adicionales descritos en la documentaci&#243;n de un controlador del dispositivo.</p>

    <p>Para restablecer los par&#225;metros de solicitud del dispositivo seleccionado a los valores por defecto, haga clic en el bot&#243;n <em>Restablecer</em>. Para abrir el formulario de propiedades del dispositivo, en caso de que se soporte por un controlador del dispositivo seleccionado, haga clic en el bot&#243;n <em>Propiedades </em>o use un men&#250; emergente del explorador de proyectos. Para establecer las propiedades globales para un tipo de dispositivo, elija la p&#225;gina <em>Controladores</em>, seleccione un controlador del dispositivo y haga clic en el bot&#243;n <em>Propiedades </em>si est&#225; habilitado.</p>

    <p>Para importar las l&#237;neas de comunicaci&#243;n y los dispositivos de la base de datos de configuraci&#243;n a los ajustes del Comunicador, haga clic derecho en el nodo <em>L&#237;neas de comunicaci&#243;n</em> o un nodo de una l&#237;nea de comunicaci&#243;n espec&#237;fica en el explorador de proyectos y seleccione un elemento <em>Importar </em>en el men&#250; contextual. El formulario de importaci&#243;n se muestra en la Imagen 3.</p>

    <p class="sd-article-image"> <img src="communication-with-devices-files/comm_import_en.png" alt="Ajustes de importación del Comunicador"><br> Imagen 3. Ajustes de importaci&#243;n del Comunicador </p>

    <p>La gesti&#243;n de la funci&#243;n de sincronizaci&#243;n de ajustes (refi&#233;rase a la Imagen 4) se realiza usando el men&#250; contextual de la l&#237;nea de comunicaci&#243;n. La sincronizaci&#243;n permite actualizar los par&#225;metros de las l&#237;neas de comunicaci&#243;n existentes y los dispositivos seg&#250;n la base de datos de configuraci&#243;n. Sin embargo, se puede que los par&#225;metros ingresados a mano se pierdan.</p>

    <p class="sd-article-image"> <img src="communication-with-devices-files/comm_sync_en.png" alt="Ajustes de sincronización del Comunicador"><br> Imagen 4. Ajustes de sincronizaci&#243;n del Comunicador </p>
</body>
</html>
