<!DOCTYPE html>
<html dir="ltr">
<head>
    <title>Afinaci&#243;n de la base de datos de configuraci&#243;n - Documentaci&#243;n de Rapid SCADA</title>
    <meta charset="utf-8">
    <link href="../../../../css/scadadoc.min.css" rel="stylesheet" type="text/css">
    <script type="text/javascript" src="../../../../lib/jquery/jquery.min.js"></script>
    <script type="text/javascript" src="../js/contents.js"></script>
    <script type="text/javascript" src="../../../../js/scadadoc.js"></script>
</head>
<body>
    <h1>Afinaci&#243;n de la base de datos de configuraci&#243;n</h1>

    <h2>Estructura de la base de datos de configuraci&#243;n</h2>

    <p>La base de datos de configuraci&#243;n es una descripci&#243;n estructurada de todo el sistema automatizado. Las aplicaciones incluidas en Rapid SCADA utilizan la informaci&#243;n de la base de datos de configuraci&#243;n conjuntamente con sus ajustes.</p>

    <p>La base de datos de configuraci&#243;n se edita usando la aplicaci&#243;n Administrator como parte de un proyecto. La instancia editada de la base de datos de configuraci&#243;n es en el formato de archivo XML. Cuando un proyecto se sube al servidor para su ejecuci&#243;n, la base de datos de configuraci&#243;n se convierte en un formato DAT especial.</p>

    <p>La base de datos de configuraci&#243;n consiste en tablas, que a su vez se componen de columnas y filas. Cada tabla pertenece a uno de los siguientes grupos:</p>

    <ol>
        <li><em>System.</em> Este grupo contiene las tablas que definen la configuraci&#243;n de un sistema automatizado particular.</li>
        <li><em>Dictionaries</em>. Este grupo contiene las tablas auxiliares. En la mayor&#237;a de los casos no se requiere cambiar estas tablas.</li>
    </ol>

    <p>La siguiente tabla describe las tablas de la base de datos de configuraci&#243;n.</p>

    <table class="sd-article-table">
        <tr>
            <th>Nombre de tabla</th>
            <th>Descripci&#243;n</th>
        </tr>
        <tr>
            <td colspan="2"><strong>Sistema</strong></td>
        </tr>
        <tr>
            <td><em>Objects</em></td>
            <td>Contiene los objetos l&#243;gicos que se usan para estructurar la informaci&#243;n en el sistema. Los objetos pueden interpretarse como ubicaciones</td>
        </tr>
        <tr>
            <td><em>Communication lines</em></td>
            <td>Describe las l&#237;neas de comunicaciones que se usan para intercambiar los datos con los dispositivos.</td>
        </tr>
        <tr>
            <td><em>Devices</em></td>
            <td>Contiene los dispositivos reales o virtuales</td>
        </tr>
        <tr>
            <td><em>Input channels</em></td>
            <td>Define los datos recibidos de los dispositivos y los c&#225;lculos a aplicarles.</td>
        </tr>
        <tr>
            <td><em>Output channels</em></td>
            <td>Especifica los comandos a ser ejecutados por el sistema</td>
        </tr>
        <tr>
            <td><em>Roles</em></td>
            <td>Contiene los roles. Cada rol define el conjunto de funciones disponibles para un determinado usuario</td>
        </tr>
        <tr>
            <td><em>Users</em></td>
            <td>Contiene una lista de los usuarios del sistema y de sus roles</td>
        </tr>
        <tr>
            <td><em>Interface</em></td>
            <td>Contiene las descripciones de los objetos de la interfaz (las ventanas de los datos, vistas e informes)</td>
        </tr>
        <tr>
            <td><em>Rights</em></td>
            <td>Define los derechos para mostrar los objetos por roles</td>
        </tr>
        <tr>
            <td colspan="2"><strong>Diccionarios</strong></td>
        </tr>
        <tr>
            <td><em>Channel types</em></td>
            <td>Diccionario de los tipos de canales de entrada</td>
        </tr>
        <tr>
            <td><em>Command types</em></td>
            <td>Diccionario de los tipos de comandos usados por canales de salida</td>
        </tr>
        <tr>
            <td><em>Event types</em></td>
            <td>Diccionario de los tipos de eventos del sistema y los estados de los canales de entrada en el archivo</td>
        </tr>
        <tr>
            <td><em>Device types</em></td>
            <td>Diccionario de los tipos de dispositivos que pueden estar conectados al sistema</td>
        </tr>
        <tr>
            <td><em>Quantities</em></td>
            <td>Diccionario de las cantidades medidas</td>
        </tr>
        <tr>
            <td><em>Units</em></td>
            <td>Diccionario de las unidades de los valores de los canales de entrada y de los valores enumerables de canales de entrada</td>
        </tr>
        <tr>
            <td><em>Command values</em></td>
            <td>Diccionario de los valores de los comandos enumerables que se transmiten por los canales de salida</td>
        </tr>
        <tr>
            <td><em>Number formats</em></td>
            <td>Diccionario de los formatos que se usan para visualizar los valores de canales de entrada</td>
        </tr>
        <tr>
            <td><em>Formulas</em></td>
            <td>Diccionario de las f&#243;rmulas usadas en el c&#225;lculo de los datos de canales de entrada y de los valores de los comandos de los canales de salida</td>
        </tr>
    </table>

    <h2>Edici&#243;n de la base de datos de configuraci&#243;n</h2>

    <p>Las tablas de la base de datos de configuraci&#243;n est&#225;n relacionadas entre s&#237;, es decir, una celda de una tabla puede referirse a un registro de otra tabla. Por ejemplo, cada dispositivo se refiere a la l&#237;nea de comunicaci&#243;n con la cual est&#225; conectado. As&#237;, es eficiente editar las tablas en una cierta secuencia. Para las tablas del grupo <em>System </em>ingrese los datos en orden empezando con la tabla <em>Objects </em>y terminando con la tabla <em>Rights</em>.</p>

    <p>Para a&#241;adir las l&#237;neas de comunicaci&#243;n y los dispositivos, se recomienda utilizar los asistentes que se abren usando los botones <img src="../../common-images/add_line.png"> y <img src="../../common-images/add_device.png">. El uso del asistente le permite a&#241;adir una entrada en la tabla de la base de datos de configuraci&#243;n y tambi&#233;n crear la entidad correspondiente en los ajustes del Comunicator. Para crear los canales de entrada y de salida utilice el asistente que se abre usando el bot&#243;n <img src="../../common-images/create_cnls.png">. Sin embargo, la creaci&#243;n autom&#225;tica de canales debe ser soportada por los controladores de los dispositivos seleccionados, de lo contrario habr&#237;a que ingresarlos a mano.</p>

    <p>Cuando se muestra el bot&#243;n <img src="../../common-images/props.png"> en la barra de herramientas, la tabla puede editarse usando la vista de formulario. Los formularios para editar las propiedades de canales se muestran en las im&#225;genes 1 y 2.</p>

    <p class="sd-article-image"> <img src="tune-database-files/in_cnl_props_en.png" alt="Propiedades de un canal de entrada"><br> Imagen 1. Propiedades de un canal de entrada </p>

    <p class="sd-article-image"> <img src="tune-database-files/out_cnl_props_en.png" alt="Propiedades del canal de salida"><br> Imagen 2. Propiedades del canal de salida </p>

    <p>Es posible acelerar significativamente&#160;la creaci&#243;n de una base de datos de configuraci&#243;n usando los trabajos existentes. Para intercambiar la informaci&#243;n entre diferentes bases de datos, la aplicaci&#243;n Administrator incluye las funciones <em>Import table</em> y <em>Export table</em> (refi&#233;rase a las im&#225;genes 3 y 4) que est&#225;n accesibles en el men&#250; <em>File (Archivo)</em>. Es posible exportar las tablas a archivos en formato DAT, XML y CSV. Luego es posible importar la informaci&#243;n en archivos DAT u XML en el mismo u en otro proyecto. Limite el rango de los datos exportados e importados especificando los identificadores de inicio y fin. Si el identificador de nuevo destino para la operaci&#243;n de importaci&#243;n est&#225; seleccionado, los datos se importan con un&#160;offset (desplazamiento) de identificadores.</p>

    <p class="sd-article-image"> <img src="tune-database-files/admin_import_table_en.png" alt="Tabla de importación"><br> Imagen 3. Tabla de importaci&#243;n </p>

    <p class="sd-article-image"> <img src="tune-database-files/admin_export_table_en.png" alt="Tabla de exportación"><br> Imagen 4. Tabla de exportaci&#243;n </p>

    <p>Disponemos de una herramienta de clonaci&#243;n para los canales de entrada y salida (refi&#233;rase a la imagen 5). En el formulario <em>Clone Channels (Clonar canales)</em> rellene los n&#250;meros de canales fuente y destino. Si se requiere, seleccione un nuevo objeto y un nuevo dispositivo nuevo para los canales clonados. La funci&#243;n de actualizaci&#243;n de los n&#250;meros de canales en las f&#243;rmulas se aplica si un n&#250;mero de canal se usa como argumento en las siguientes funciones: N(), Val(), Stat(), SetVal(), SetStat() y SetData().</p>

    <p class="sd-article-image"> <img src="tune-database-files/admin_clone_cnls_en.png" alt="Clonación de canales"><br> Imagen 5. Clonaci&#243;n de canales </p>

    <p>Copiar (Ctrl + C) y pegar (Ctrl + V) est&#225;n disponibles para las celdas de tabla. Haga clic en la cabecera de la columna para ordenar las filas de la tabla por valores de aquella columna. La funci&#243;n de b&#250;squeda y reemplazo (Ctrl + F) tambi&#233;n acelera la&#160;edici&#243;n.</p>
</body>
</html>
